In [4]:
import pandas as pd
import numpy as np
import re

In [5]:
books = pd.read_csv('Books.csv')
rating = pd.read_csv('Ratings.csv')
users = pd.read_csv('Users.csv')

C:\Users\varun\AppData\Local\Temp\ipykernel_1768\1204645170.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  books = pd.read_csv('Books.csv')

In [6]:
books.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L'],
      dtype='object')

In [7]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [8]:
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [9]:
rating.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [10]:
books.shape

(271360, 8)

In [11]:
rating.shape

(1149780, 3)

In [12]:
users.shape

(278858, 3)

In [13]:
books.isna().sum()

ISBN                   0
Book-Title             0
Book-Author            2
Year-Of-Publication    0
Publisher              2
Image-URL-S            0
Image-URL-M            0
Image-URL-L            3
dtype: int64

In [14]:
users.isna().sum()

User-ID          0
Location         0
Age         110762
dtype: int64

In [15]:
rating.isna().sum()

User-ID        0
ISBN           0
Book-Rating    0
dtype: int64

In [16]:
users.duplicated().sum()

0

In [17]:
dfp = rating.merge(books,on='ISBN')

In [18]:
dfp.shape

(1031136, 10)

In [19]:
num_rating_df=dfp.groupby('Book-Title').count()['Book-Rating'].reset_index()
num_rating_df.rename(columns={'Book-Rating':'num_ratings'},inplace=True)
num_rating_df

                                               Book-Title  num_ratings
0        A Light in the Storm: The Civil War Diary of ...            4
1                                   Always Have Popsicles            1
2                    Apple Magic (The Collector's series)            1
3        Ask Lily (Young Women of Faith: Lily Series, ...            1
4        Beyond IBM: Leadership Marketing and Finance ...            1
...                                                   ...          ...
241066                                      Ã?Â?lpiraten.            2
241067                     Ã?Â?rger mit Produkt X. Roman.            4
241068                                Ã?Â?sterlich leben.            1
241069                              Ã?Â?stlich der Berge.            3
241070                                  Ã?Â?thique en toc            2

[241071 rows x 2 columns]

In [20]:
def pre(txt):
    txt = re.sub('[^a-zA-Z]',' ',txt)
    return txt

In [21]:
num_rating_df['Book-Title'] = num_rating_df['Book-Title'].apply(pre)

In [22]:
num_rating_df

                                               Book-Title  num_ratings
0        A Light in the Storm  The Civil War Diary of ...            4
1                                   Always Have Popsicles            1
2                    Apple Magic  The Collector s series             1
3        Ask Lily  Young Women of Faith  Lily Series  ...            1
4        Beyond IBM  Leadership Marketing and Finance ...            1
...                                                   ...          ...
241066                                          lpiraten             2
241067                         rger mit Produkt X  Roman             4
241068                                    sterlich leben             1
241069                                  stlich der Berge             3
241070                                      thique en toc            2

[241071 rows x 2 columns]

In [23]:
           
avg_df=dfp.groupby('Book-Title')['Book-Rating'].mean().reset_index()
avg_df.rename(columns={'Book-Rating':'avg_ratings'},inplace=True)
avg_df

                                               Book-Title  avg_ratings
0        A Light in the Storm: The Civil War Diary of ...     2.250000
1                                   Always Have Popsicles     0.000000
2                    Apple Magic (The Collector's series)     0.000000
3        Ask Lily (Young Women of Faith: Lily Series, ...     8.000000
4        Beyond IBM: Leadership Marketing and Finance ...     0.000000
...                                                   ...          ...
241066                                      Ã?Â?lpiraten.     0.000000
241067                     Ã?Â?rger mit Produkt X. Roman.     5.250000
241068                                Ã?Â?sterlich leben.     7.000000
241069                              Ã?Â?stlich der Berge.     2.666667
241070                                  Ã?Â?thique en toc     4.000000

[241071 rows x 2 columns]

In [24]:
popular_df = num_rating_df.merge(avg_df,on='Book-Title')

In [25]:
popular_df

                         Book-Title  num_ratings  avg_ratings
0             Always Have Popsicles            1     0.000000
1                      Dark Justice            1    10.000000
2                          Deceived            2     0.000000
3                      It Takes Two            2     0.000000
4                      Mystery Mile            2     0.000000
...                             ...          ...          ...
80424  the Twelve Days of Christmas            1     0.000000
80425         together by christmas            9     3.111111
80426               touch the flame            1    10.000000
80427                  voyage fatal            1     0.000000
80428                  waking blood            1     6.000000

[80429 rows x 3 columns]

In [26]:
popular_df = popular_df[popular_df['num_ratings']>=250].sort_values('avg_ratings',ascending=True)

In [27]:
popular_df

                               Book-Title  num_ratings  avg_ratings
78664                         Wild Animus         2502     1.019584
30431                        Isle of Dogs          288     2.000000
46293                   Presumed Innocent          294     2.139456
78366                            Whispers          286     2.199301
16847                          Disclosure          318     2.345912
...                                   ...          ...          ...
41338                          Neverwhere          265     4.449057
58983              The Catcher in the Rye          449     4.545657
61656  The Five People You Meet in Heaven          430     4.551163
60075                   The Da Vinci Code          898     4.642539
73890               To Kill a Mockingbird          510     4.700000

[111 rows x 3 columns]

In [28]:
popular_df.shape

(111, 3)

In [29]:
popular_df = popular_df.merge(books,on='Book-Title').drop_duplicates('Book-Title')[['Book-Title','Book-Author','Image-URL-M','num_ratings','avg_ratings']]

In [30]:
popular_df

,Book-Title,Book-Author,Image-URL-M,num_ratings,avg_ratings
0,Wild Animus,Rich Shapero,http://images.amazon.com/images/P/0971880107.0...,2502,1.019584
1,Isle of Dogs,Patricia Cornwell,http://images.amazon.com/images/P/0425182908.0...,288,2.000000
7,Presumed Innocent,Scott Turow,http://images.amazon.com/images/P/0446359866.0...,294,2.139456
13,Whispers,BELVA PLAIN,http://images.amazon.com/images/P/0440216745.0...,286,2.199301
23,Disclosure,Michael Crichton,http://images.amazon.com/images/P/0345391055.0...,318,2.345912
...,...,...,...,...,...
509,Neverwhere,Neil Gaiman,http://images.amazon.com/images/P/0380789019.0...,265,4.449057
514,The Catcher in the Rye,J.D. Salinger,http://images.amazon.com/images/P/0316769487.0...,449,4.545657
521,The Five People You Meet in Heaven,Mitch Albom,http://images.amazon.com/images/P/0786868716.0...,430,4.551163
523,The Da Vinci Code,Dan Brown,http://images.amazon.com/images/P/0385504209.0...,898,4.642539
529,To Kill a Mockingbird,Harper Lee,http://images.amazon.com/images/P/0446310786.0...,510,4.700000